# Mac GUI Applications (not available in Nix or Mac-specific)
# Note: Prefer Nix for Python - avoid brew packages that install Python as dependency
cask "docker"                    # Docker Desktop for Mac
cask "iterm2"                    # Terminal emulator
cask "postman"                   # API testing tool
cask "insomnia"                  # REST client
cask "tableplus"                 # Database GUI
cask "dbeaver-community"         # Database tool
cask "webtorrent"                # BitTorrent client
cask "qbittorrent"               # Popular BitTorrent client with advanced features
cask "libreoffice"               # Open source office suite (Writer, Calc, Impress, etc.)
cask "calibre"                   # E-book management application (GUI)

# AI/ML GUI Applications
cask "chatgpt"                   # Desktop application for ChatGPT
cask "cherry-studio"             # Desktop client for multiple LLM providers
cask "lm-studio"                 # GUI for running local LLMs
cask "jan"                       # Open-source ChatGPT alternative
cask "gpt4all"                   # Run LLMs locally with GPU support

# Cloud Development Tools (Mac-specific installers)
brew "awscli"                    # AWS CLI (prefer Homebrew version on Mac)
cask "google-cloud-sdk"          # Google Cloud SDK

# Mac-specific tools
brew "mas"                       # Mac App Store command line interface

# Tools not easily available in Nix or work better via Homebrew on Mac
brew "aria2"                     # Lightweight download utility

# Network monitoring tools (Linux-only in Nix, available via Homebrew on Mac)
brew "nethogs"                   # Monitor per-process network usage
brew "bmon"                      # Real-time network bandwidth monitor
brew "iftop"                     # Display network usage by hosts
brew "nload"                     # Console network traffic monitor
brew "transmission-cli"          # BitTorrent client (command-line interface)

# Mac App Store Apps
mas "Xcode", id: 497799835
mas "Slack", id: 803453959
# mas "Microsoft Teams", id: 1113153706
