ms-python.python
ms-python.vscode-pylance
ms-python.black-formatter
golang.go
rust-lang.rust-analyzer
ms-vscode.cpptools
ms-azuretools.vscode-docker
ms-kubernetes-tools.vscode-kubernetes-tools
ms-vscode-remote.remote-wsl
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
eamodio.gitlens
dbaeumer.vscode-eslint
esbenp.prettier-vscode
GitHub.copilot
GitHub.copilot-chat
redhat.vscode-yaml
hashicorp.terraform
ms-vscode.powershell
timonwong.shellcheck
foxundermoon.shell-format
yzhang.markdown-all-in-one
streetsidesoftware.code-spell-checker
usernamehw.errorlens
vscodevim.vim
EditorConfig.EditorConfig
